{
    "title": "Mauricio Pochettino paid the price of rocking Todd Boehly’s boat at Chelsea",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Fellow fans, this is a friendly reminder to please follow the [Rules](https://www.reddit.com/r/premierleague/about/rules) and [Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette). \n\nPlease also make sure to [Join us on Discord](https://discord.gg/football)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PremierLeague) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Headlesshorsman02",
            "body": "It is not Todd Bohley ffs 🤦‍♂️. It is egbalhi and the directors that keep making these dumb ass decisions, apparently Bohley wanted Poch to stay",
            "score": 73,
            "replies": [
                {
                    "depth": 1,
                    "author": "hipcheck23",
                    "body": "Yeah, it's painful how Todd's name is a catch-all for every headline.\n\nThe article itself is better than the headline, at least - and doesn't feel like a PR piece from Matt Law.",
                    "score": 23
                }
            ]
        },
        {
            "depth": 0,
            "author": "Fappacus",
            "body": "Todd Boehly is just the face. He’s not in charge nor does he make decisions. He even wanted Poch to stay.",
            "score": 41,
            "replies": [
                {
                    "depth": 1,
                    "author": "BulletTheDodger",
                    "body": "Boehlluminati.",
                    "score": 8
                }
            ]
        },
        {
            "depth": 0,
            "author": "Teaboy1",
            "body": "So what self-respecting manager is going to go to Chelsea. No top coach is gonna entertain that nonsense. \n\nThey can buy all the players they want but the sharp end of competitions is about tactical adaptability. You know the thing that separates pep, klopp, ancelotti from the others.",
            "score": 33,
            "replies": [
                {
                    "depth": 1,
                    "author": "LuckyNumber003",
                    "body": "Frank in",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "endofthered01674",
                    "body": "The funny bit is Liverpool are basically doing the same thing post-Klopp.",
                    "score": -5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jltho",
                            "body": "What does this even mean?",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "casualbear3",
                                    "body": "It's provocative. It gets the people going.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "endofthered01674",
                                            "body": "Not at all. Their new setup is much the same, hehce why Arne Slot's title is head coach, not manager. They even posted a job for a first team set piece coach. \n\nhttps://jobsearch.liverpoolfc.com/",
                                            "score": 0
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "CamIoM",
                            "body": "Huh?",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "Kebab_Lord69",
                            "body": "Reckon our transfer strategy is a bit better but in terms of coach leadership responsibilities it’s similar",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Ajgrob",
            "body": "This is perhaps the funniest part of the whole article. I would love if this actually came from a source at the club:\n\n\"They are scouring the globe and are close to completing a deal for the Palmeiras sensation, Estêvão Willian, for just over €60m. Estêvão, 17, is seen as a future Ballon d’Or winner by good judges. Chelsea’s plan is ambitious. It can look crazy. If it works, though, they could end up with one of the best teams in the world.\"",
            "score": 28,
            "replies": [
                {
                    "depth": 1,
                    "author": "Jiminyfingers",
                    "body": "They are not the first to try 'project youth'. At the end of the day buying lots of talented kids is always a gamble: how many translate teenage prowess into adult world class talent? There are always casualties along the way. ",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Taca-F",
                            "body": "It can only work if there's a solid, long term organisation around those players of coaching staff and football people, especially a director of football type position, which can handle all the different situations young players get into. The manager isn't actually that important, they are more like a hired gun.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "oldschoolology",
                    "body": "Buying an unproven speculative 17 year old for $60 million and selling a proven player like Gallagher for $30 million is upside down management.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "BreakSad8773",
                    "body": "I'm sorry but if Messi was given a 8 year deal at 100k a week, I don't think he makes it much further than 2008.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "EarlofBizzlington86",
                            "body": "What?",
                            "score": 13
                        },
                        {
                            "depth": 2,
                            "author": "CamIoM",
                            "body": "I disagree, but the point you’re making is good. Discipline is important in young players, and getting money and job security thrown at you is a quick way to lose that discipline",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "TheRealKane24",
            "body": "People gotta stop saying Boehly, it’s Beghdad Eghbali that’s making these rash decisions",
            "score": 42,
            "replies": [
                {
                    "depth": 1,
                    "author": "Headlesshorsman02",
                    "body": "Facts!!! Egbalhi is getting exactly what he wants, to be able to do this shit with no repercussions due to Bohley being his fall guy",
                    "score": 22
                }
            ]
        },
        {
            "depth": 0,
            "author": "ZookeepergameOk2759",
            "body": "Such an odd club.",
            "score": 44,
            "replies": [
                {
                    "depth": 1,
                    "author": "_CHIFFRE",
                    "body": "very good entertainment product though with all the drama, maybe that's the aim now.",
                    "score": 27,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PenisManNumberOne",
                            "body": "I can’t wait to see what Ten Hag’s old punching bag will do that’s gonna be entertaining",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "jrhunter89",
            "body": "I don’t think Poch is too bothered about it",
            "score": 18
        },
        {
            "depth": 0,
            "author": "HollowCrown",
            "body": "Nope this is more of an EggBaldy move than a Tod",
            "score": 18
        },
        {
            "depth": 0,
            "author": "FarrOutMan7",
            "body": "It’s alright Chelsea fans. Don’t worry. \n\nYou’ll get De Zerbi in and then you’ll submit a bid for the Amex Stadium. The transformation is nearly complete.",
            "score": 32,
            "replies": [
                {
                    "depth": 1,
                    "author": "BDR529forlyfe",
                    "body": "De Zerbi will get fire in 6 months whether he’s winning or not",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "tanbirj",
                    "body": "Need to buy Tony Bloom as well",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "soccer_footballmania",
            "body": "He could have been given more time. Sad for him",
            "score": 17,
            "replies": [
                {
                    "depth": 1,
                    "author": "hipcheck23",
                    "body": "If you read the various articles that are out now, you'll see that they paint a picture of mutual dissatisfaction. Poch signed up for something specific, and tried to nudge it toward how he was used to doing things, and in the end, both sides disagreed too much about it all. Don't be sad for Poch - maybe the players, because they all liked him, but Poch was pretty Poch-Out at the end.",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bigfootswillie",
                            "body": "The biggest loser here are definitely Chelsea fans. This stint here absolutely revived Poch’s career for consideration among top clubs.",
                            "score": 7
                        },
                        {
                            "depth": 2,
                            "author": "MarcusZXR",
                            "body": "Am I correct when i say this is the second manager [Tuchel]  that's been dissatisfied with the disagreements and lack of flexibility from the board? I might be wrong, though.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "hipcheck23",
                                    "body": "In a way, but the two situations were quite different, and the boards were quite different then & now.",
                                    "score": 0
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Banned_and_Boujee",
            "body": "I don’t think Pochettino is paying the price for anything. He was paid handsomely and will be managing somewhere next year, probably with better bosses.",
            "score": 27,
            "replies": [
                {
                    "depth": 1,
                    "author": "JonHammsHamm",
                    "body": "I'm no Chelsea fan, but I thought Poch did alright from what I did see. Am I wrong here? I could be totally wrong.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BlueKante",
                            "body": "It was extremely mixed. Had you asked before February most people were probably poch out. However we improved a lot at the end of the season.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "JonHammsHamm",
                                    "body": "That's what I thought. First bit seemed rough, but he was new. It seemed like when he settled in, things really got going. Sometimes I wish there was more grace given to gaffers.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BlueKante",
                                            "body": "Im not really sad to him go but the way he was dissmissed makes the players feel betrayed and the list of replacements is litteral garbage. Im worried for another potter fiasco, but this time it will be an italian from brighton instead of an Englishman.",
                                            "score": 4
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "WonderfulBlackberry9",
                                    "body": "From afar the standout result for the second half of Chelsea’s season imo was losing 5-0 at Arsenal. \n\nBut I had a quick run through the results since late January and that’s a genuinely great run that - as a neutral - really went under the radar. Beating United and Spurs, drawing at City in February (1-0 up for most of it too), the comeback draw vs Villa (which I thought VAR robbed you of a win), the 6-0 and 5-0 hammerings of Everton and West Ham.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "concussaoma",
                            "body": "Most fans were on board with bringing him back at the end.  Getting 6th with an almost all new young squad and the amount of injuries we had had is a good season.  \n\nI was excited to see what Poch could cook up next season.  Feels bad ngl",
                            "score": 6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Grand_Glizzy",
                    "body": "lol when he goes to Yanited",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "nitram343",
            "body": "honestly he went into a very tricky role, to go out with reputation intact and the money... so I think he wont be particularly sad.",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "Michael_McGovern",
                    "body": "He definitely benefits from the manager market being in the toilet as well.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "hipcheck23",
                    "body": "Exactly. I don't think he's worse off in any way. Perhaps he'll miss some of his players, but he'll be re-hired quickly, and as you say, rep intact.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "dfebb",
            "body": "Pocchettino \"paid the price\" as in, Chelsea have paid him for a whole year's worth of work that he now doesn't have to do.",
            "score": 35,
            "replies": [
                {
                    "depth": 1,
                    "author": "Rorviver",
                    "body": "Not usually how it works. If he takes another job chelsea likely won’t be obliged to keep paying him.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ecstatic-Love-9644",
                            "body": "Actually that is actually exactly how it always works \n\n\nIf he is employed - the new employers will buyout his Chelsea contract and gaurentee him on top, if he isn’t he gets the cash for doing fuck all.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "lexwtc",
                    "body": "Got a source to prove this is the case?",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Bigwhtdckn8",
                    "body": "More cash to add the the ffp deficit *rubs hands with glee*",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "RefanRes",
            "body": "I dont think many Chelsea fans are convinced this was a Boehly decision. Boehly comes out the other week seemingly happy with the progress being made and saying he can see the plan is coming together when he watches how they play. He also takes Poch to dinner last week ahead of this meeting. No mention of Eghbali.\n\nThen this meeting happens. Eghbali turns up, apparently with a load of crap data about big chances missed and things which the manager cant actually be responsible for. Questioning the injury record under Poch when Chelsea have had the worst injury record in the PL for several seasons. Also, when Poch was at Spurs his methods were praised as being the reason Spurs players had significantly less soft tissue injuries. Maybe, just maybe it takes time for players bodies to adapt to new training regimens and these injuries were more just a continuation of injuries from the several seasons this injury situation has been going on. \n\nIt seems clear that Boehly is a scapegoat and its really scrambled egg brained Eggbali pulling the trigger on this stuff. He also probably went into that meeting knowing full well that Poch wouldn't budge on wanting to keep Conor Gallagher and Trevoh Chalobah but Eggy is intent on selling for profit. So he essentially constructed the conditions where Poch would choose to leave.",
            "score": 46,
            "replies": [
                {
                    "depth": 1,
                    "author": "Plastic_Primary_4279",
                    "body": "Tbf, many have questioned his training habits, including players from his former clubs. He was having them do heavy training the day before games. It baffles everyone but him and his staff.",
                    "score": -2
                }
            ]
        },
        {
            "depth": 0,
            "author": "ezee-now-blud",
            "body": "I think it was more his decision after realising they were going to do dumb shit like sell Gallagher and constantly fuck with his plans.",
            "score": 24
        },
        {
            "depth": 0,
            "author": "JJGOTHA",
            "body": "Nah. This had EggBaddy all over it",
            "score": 9
        },
        {
            "depth": 0,
            "author": "Pengu277",
            "body": "The boats underwater",
            "score": 11
        },
        {
            "depth": 0,
            "author": "XODude",
            "body": "lmao. it’s so funny seeing rival fans going boehly this and boehly that. it’s that brother Behdad that’s actually at the wheel lmao.",
            "score": 35,
            "replies": [
                {
                    "depth": 1,
                    "author": "Headlesshorsman02",
                    "body": "Bro gets none of the blame in the media, I swear they just see Bohley as the idiot American when Egbalhi is the true puppet master and idiot of our club",
                    "score": 21,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SomewhereVirtual4121",
                            "body": "Genuinely curious why is Todd the one who gets the shit for it all",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Purosangue_Papa",
                                    "body": "Because no one can spell Behdad Eghbali",
                                    "score": 12
                                },
                                {
                                    "depth": 3,
                                    "author": "btmalon",
                                    "body": "That's the entire point of having a figurehead, to take the blame. And if he draws enough hate they'll shuffle him away for a new guy to take the blame so the real power is protected.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "hipcheck23",
                                            "body": "I think the other points are valid, but this is the point that hardly ever gets brought up - it's part & parcel with the role. He signed up for it and isn't going to shy away from it, no matter how many tabloid journos say that everything that happens at The Bridge is done by Todd.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Eduardo69mee",
                                    "body": "Cus he’s American, and it’s low hanging fruit to make fun of Americans when it comes to the sport",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "SomewhereVirtual4121",
                                            "body": "True, he must not care otherwise he’d say it’s not me it’s him",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "eyanez13",
            "body": "They are trying to run solely on data and moneyball this club and turn them into a dynasty. \n\nThat’s not how football works.",
            "score": 26,
            "replies": [
                {
                    "depth": 1,
                    "author": "Brendannelly",
                    "body": "Analytics are moving into all sports football is no different.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "eyanez13",
                            "body": "It can work and I’m for it but it’s not the end all be all, this like forward progression or forward ball carries are why players like CHO were over valued.\n\nJust more nuance is in football than baseball is all kk saying",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "GMD3S1GNS",
                    "body": "Can we just kick these American owners out of football already, they’re so stupid and don’t understand the game at all. Did anyone hear that story that Boely even wanted to start a kiss cam at Stamford bridge, will probably get someone Tom Cruise to give the team talk one week as well next. Don’t fully agree with everything around Middle Eastern owners but at least they actually get it and know how to run a club and develop the community around it. Look at the area around the Etihad these days, still wish the Qataris bought Man United",
                    "score": -6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "No-Market9917",
                            "body": "It’s Behdad Egbahli’s decision. You have no idea what you’re talking about",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "CooCooClocksClan",
                            "body": "I don’t recall a single English owned team ever having culture issues, poor recruiting, consistently poor performances or going into administration. Nope that only happens with the American owned teams",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "xxconkriete",
                            "body": "Very happy with the Americans running Arsenal atm. Let us be 🙂",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ACM1PT21",
                                    "body": "Dude I am a an American Chelsea fan and I can tell you Americans are fucking up the big teams. You are having a good run but haven't won shit, how are you happy with that when Arsenal could be more? Look at United and now Chelsea.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "xxconkriete",
                                            "body": "I’m elated with how Arsenal are running now, financially and on the pitch.\n\nI’d love for us to win more silverware but it’s hard for everyone when you have a team committing financial crimes running the pack. \n\nJust because Utd and Chelsea are dross =/= American owners bad.",
                                            "score": 2
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "GMD3S1GNS",
                                    "body": "You protested to have them removed and wanted the Spotify guy to buy your club",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "xxconkriete",
                                            "body": "Not I, but ok.",
                                            "score": 4
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Whaloopiloopi",
                            "body": "Don't say that last bit. Sir Jim is from Failsworth and Burnham is apparantly clean up his arse these days. We're gonna see some real development on Trafford Park, it's almost garunteed if we build a new stadium because media city is also getting a revamp. Worst case scenario: new stadium, new media city, old Trafford gets tidied up and turned into a museum and they play women's or youth games there.\n\nBest case scenario: gorse hill gets gold plated top to bottom with marble pavements.\n\nI'd settle for either but ngl gorse Hill could do with a spruce up, like.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Takkotah",
            "body": "At least he got the boat floating before Todd decided to sink it again.",
            "score": 19,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Takkotah",
                            "body": "Burn it all! (money)",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "akhil1980",
            "body": "What a fucking puff piece sponsored by the club. Journo should be ashamed of writing it up.",
            "score": 20,
            "replies": [
                {
                    "depth": 1,
                    "author": "woooowzers",
                    "body": "It spent the whole piece parading the ownership and youth-centred recruitment of the club, as if it doesn't have a role in the current predicament.\n\nThen as if to waive off criticism that the rapid-firing of managers isn't a sustainable model. The author provides one paragraph at the very end to ground it. \n\nIt's embarassing the amount of Boehly dick-riding in this article. I think even the most ardent Chelsea supporters view the current management crisis of the club as unsustainable.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Nels8192",
            "body": "Wasn’t too surprising after his “if they still want me, and I still want them” comments",
            "score": 10
        },
        {
            "depth": 0,
            "author": "Plastic_Primary_4279",
            "body": "Everything points to Boehly being the one who wanted him to stay, everyone else thought differently. \n\nTB has little to do with decision making at Chelsea, it’s almost funny how everyone acts like he’s the guy with the final word.",
            "score": 39,
            "replies": [
                {
                    "depth": 1,
                    "author": "GrizzlyBeardBabyUnit",
                    "body": "Exactly this. People just like shitting on TB.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Regular_Possession74",
                            "body": "Eghbali",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "going_down_leg",
            "body": "I think Poch got himself sacked so he could get the united job. Apparently he’s wanted that for ages.",
            "score": 28
        },
        {
            "depth": 0,
            "author": "wobbly_doo",
            "body": "Boehly's name getting dragged in the mud when it was actually Eghbali who is making all the mess",
            "score": 26,
            "replies": [
                {
                    "depth": 1,
                    "author": "Headlesshorsman02",
                    "body": "It genuinely pisses me off that he gets off Scott free in the media",
                    "score": 10
                }
            ]
        },
        {
            "depth": 0,
            "author": "thehonorablechad",
            "body": "Nice to see the ghost of Roman Abramovic is still wandering the halls of Stamford Bridge.",
            "score": 26,
            "replies": [
                {
                    "depth": 1,
                    "author": "LJey187",
                    "body": "Glad someone else see's that this is nothing new. Look at the manager list since Jose in 2004 they have had 20 managers.\n\nAbsolutely insane why anyone would take that job for anything except the inevitable payout.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "gr1m0s",
            "body": "Rest of the PL playing football. Chelsea playing Egg Balh.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "BarryCleft79",
            "body": "The writing was on the wall in the early days when boehly was going in the dressing room all the time. Would have wound any manager off",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "L0laccio",
                    "body": "You mean it wasn’t inspirational? You have suffered a tough loss, you’re gutted and a brash American business man wades in. You’re inspired, right?",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BarryCleft79",
                            "body": "Ha! I’d imagine there were multiple eye rolls everytime he waltzed in the room",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "robpottedplant",
            "body": "If you buy Chelsea you also buy into a philosophy of managerial replacement",
            "score": 13
        },
        {
            "depth": 0,
            "author": "alex08stockholm",
            "body": "Hire and Fire...",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "daChino02",
                    "body": "Always been the Chelsea way",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "jide_oloko",
            "body": "Chelsea should go for Piero Gasperini",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Proud-Cheesecake-813",
            "body": "I’m sure Mauricio is gutted he no longer has to manage that car crash.",
            "score": 18
        },
        {
            "depth": 0,
            "author": "Waldotto",
            "body": "Which boat? The Titanic?",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "pato2205",
                    "body": "Costa Concordia",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bigelcid",
                            "body": "Did you see the Cost of Concordia?",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Britori0",
                    "body": "Rich coming from a fan of the Britannic.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Soitsgonnabeforever",
                    "body": "Stellar Daisy",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Keyblades2",
            "body": "and got them 6th. shoot meet foot.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "xxconkriete",
            "body": "He brought that dross to European football, did he really pay any price? He’s getting bank",
            "score": 11
        },
        {
            "depth": 0,
            "author": "ozairh18",
            "body": "I think Eghbali, Stewart and Winstanley are the problem. Boehly took a step back after Potter was sacked",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "fGravity",
                    "body": "How do you know?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ozairh18",
                            "body": "I don’t know but Boehly complimenting how beautiful Chelsea played to end the season and Eghbali being the one to spearhead Pochettino’s end of season review said a lot",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "coupl4nd",
            "body": "Boat? Sinking ship more like.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "belanaria",
                    "body": "The way it’s phrased it seems like he’s nailing Boehly in a boat… quite hard 🫠",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "HavUevaSeentherain",
                            "body": "What a terrible day to have the power of imagination",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "belanaria",
                                    "body": "And potentially the ability to read for you good sir.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "LordDinner",
                            "body": "I also thought the same. They need to change that headline.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "belanaria",
                                    "body": "Truly",
                                    "score": 0
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "moruga1",
            "body": "reTodd Boehly is going to pay that price…",
            "score": 10
        },
        {
            "depth": 0,
            "author": "mashqulgii",
            "body": "Chelsea is messed, players are brought by the owner and telling Manager to get trophies",
            "score": 5
        },
        {
            "depth": 0,
            "author": "SavingsKale7308",
            "body": "That ship is now an unimprovised submarine.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "tkwoodrow20",
                    "body": "Nicolas Jackson should feel right at home next season then",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "TariboWest1731",
            "body": "Boehly should hire Tuchel.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "DeltaMusicTango",
                    "body": "Maybe as an interim until Potter becomes available.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "trooky67",
            "body": "Boehly's playing the football manager game with a real club and not doing a very good job.\n\nHe's spent around a billion to make his side worse, I think it's time to start a new save!!!",
            "score": 17,
            "replies": [
                {
                    "depth": 1,
                    "author": "SuspiciousSystem1888",
                    "body": "The amount of people who think Boehly had/has the final say is quite comical. \n\nEgg head is the has been doing more damage, but stays out of the spotlight. \n\nNot saying it clears Boehly at all, but there’s more to it than just him. ",
                    "score": 14
                },
                {
                    "depth": 1,
                    "author": "CMYGQZ",
                    "body": "He’s a bad FM player too then. Even in FM those wouldn’t be the best decisions.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "myhero34",
                    "body": "Did Donald Trump write this",
                    "score": -2
                },
                {
                    "depth": 1,
                    "author": "GMD3S1GNS",
                    "body": "Yank being a yank basically, expect some halftime shows at the bridge pretty soon",
                    "score": -6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LogicalGrand1678",
                            "body": "Egbhali being egbhali is more accurate. Big man todd just smiles at the camera",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "HiyaImRyan",
                    "body": "That's not how FM works mate, he's not the manager for starters.",
                    "score": -2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "trooky67",
                            "body": "No but he thinks he is",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "HiyaImRyan",
                                    "body": "You're obviously missing the point",
                                    "score": -1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "hipcheck23",
            "body": "TBF I had a job like this. Was hired to do a music video - they told me exactly how it would go, but I strayed from it, because I knew better. I had my own crew, I knew the best way to go about getting exactly what they wanted... but they didn't hire me to do that; they hired me to follow their instructions. Everyone else was shocked when I was sacked.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "Novacain-deficiency",
                    "body": "Eghbali wants a puppet, I fucking hate our ownership. Fucking clowns",
                    "score": 19
                }
            ]
        },
        {
            "depth": 0,
            "author": "SovannRoussard",
            "body": "Todd wants to be Jerry Jones.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "Headlesshorsman02",
                    "body": "It isn’t Todd that is doing this, this is Egbalhi, Todd wanted Poch to stay",
                    "score": 11
                }
            ]
        },
        {
            "depth": 0,
            "author": "hipcheck23",
            "body": "- Poch made a cardinal mistake of thinking he could have full power when & where he wanted it - that sums up the entire problem and relationship at CFC\n- Tuchel disagreed and tried to insist, which led to his sacking (Potter is not lumped in here), and Poch took a similar initiative\n- Todd B was on the fence about keeping Poch, but Egh had been unconvinced by Poch from the start and was never won over\n- The humiliating losses to LFC, Wolves, and Arsenal didn't help Poch's case\n- Poch wasn't open to advice from the board, such as taking 'another look' at how his training might be affecting injuries\n- The SD's are in charge, and Poch didn't agree that they should oversee recruiting without him\n- There will be no \"combustible characters\" like RdZ as the next manager\n- The board think that the success is more down to them, whereas Poch felt it was down to him...",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "circa285",
                    "body": "The board are absolutely drunk on themselves if they think they had anything to do with the team’s success in the second half of the season. I’m not complaining at all, but my god, how stupid can they be?",
                    "score": 23,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Makav3lli",
                            "body": "Poch was bad, if not for Palmer’s literal magic he would’ve been sacked a few months back. \n\nA few late goals changing our games shouldn’t gloss over his tactical ineptitude on a weekly basis and his god awful subs. Chilwell at LW and Colwill and LB… games passed this tosser",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "circa285",
                                    "body": "This makes no sense to me. You’re essentially saying “Poch was bad and if not for decisions he made with playing certain players who performed well when called upon within a tactical system managed by Poch, the team would be bad”.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "lexwtc",
                                            "body": "You clearly didn't watch much chelsea then did you. We were dreadful defensively all season and if not for palmer we would've been screwed. No palmer and we come 15th under poch",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "circa285",
                                                    "body": "And who developed Palmer? Who designed the tactics that lead to Palmer having a breakout year? \n\nLook, I want you lot to be terrible, but these takes make zero sense.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "lewishamilton08",
                                                            "body": "Poch didn’t develop him. Poch literally said he has no tactics and just lets the players do whatever. You are not listening, we don’t want to become like you. We should never have appointed him in the first place, but thankfully one season and sacked. We must never become spurs",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "circa285",
                                                                    "body": "This comment tells me all that I need to know about how much you understand football. No point in discussing tactics with someone who things a premier league manager doesn't coach tactically.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "lewishamilton08",
                                                                            "body": "You aren’t listening - Poch literally said out of his own mouth he has no tactics and making a good environment for the players mentally is the most important thing.\n\nWho are you going to believe? Me or him? It came out of his own mouth, not mine.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "circa285",
                                                                                    "body": "Do you understand the difference between speaking in hyperbole and speaking literally? There are clear patterns of play that Chelsea utilizes. Those patterns are not \"random\" and are not a product of the players \"doing whatever they want\".",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "lewishamilton08",
                                                                                            "body": "That is an utter lie - what pattern of play do we utilize? The players look utterly clueless and there is no sustained build up patterns or an even semi-coordinated shape out of possession when in transition. Palmer and other individual brilliance from others carried Poch this season. He was rightfully sacked.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "circa285",
                                                                                                    "body": "Again, this tells me everything that I need to know about your understanding of football.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "lewishamilton08",
                                                                                                            "body": "You don’t watch Chelsea games so you don’t understand the shower of shit that fucking fraud Poch served up every week.",
                                                                                                            "score": 1
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "lexwtc",
                                                            "body": "Man city academy developed him 🥱 \n\nYeah u definitely don't watch Chelsea talking about pochs tactics. There are (were)  none",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "circa285",
                                                                    "body": "This ~~gas~~ has to be the silliest take that I’ve seen in a long time. There’s a *massive* difference between academy football and first team premier league football. Plenty of players come from academies and never make it. Palmer came from City's academy after he was deemed by their first team as not good enough. Poch developed him within his tactical set up. That doesn't happen on accident. There are *plenty* of things that Poch is not great at, but it seems silly to me to criticize him for something that he did well.",
                                                                    "score": 2
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Apprehensive_Aioli68",
                                                    "body": "If we had no Tuchel for the first 6 games last year and we would have been in a relegation battle. But Potter had a better defensive record than Poch...yet I'd still rather have Poch's football than Potter's.   \n  \nPalmer would have done as much as Mount under Potter, which is to say fuck all,  and our football was boring as hell under Tuchel.   \n  \nLook at city, they are methodical and tactically drilled and they are also boring as fuck to watch. I loved the edge of the seat football this season, yes it drove me mad at times, but it was entertaining as hell.",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Makav3lli",
                                            "body": "Palmer was the standout, but the team was unbalanced in simple terms…",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "circa285",
                                                    "body": "And who is in charge of recruitment for Chelsea? Is that Poch?",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "hipcheck23",
                                            "body": "There are certain things you can measure from the outside - which we fans try to do (naturally we all have diff. levels of acumen). You can look at the squad and see that there were holes and weaknesses and insane injuries, and assign blame to the players and board/SD's. But you can strip all that away and ask when subs were made, ask how lineups worked together, ask how issues were addressed/fixed, look at how set pieces were organised, etc.\n\nMost of that stuff was a net negative for me. That's absolutely not to say that Poch is awful or it was all bad - he is clearly good (or great) at man-mgmt, and the dressing room was all behind him. He has a rep for developing youth, and being objective, I'd say we could see some leaps from a few players. That stuff was a net-positive. \n\nDid the board put Poch in the best position to succeed? No - a flat no. Did Poch put the players in the best position to succeed? It's a no from me, although clearly many disagree with me these days. Did the players execute as best they could? I'd say, based on age and experience (including playing together), they probably exceeded this a bit.\n\nWould the players do better under Manager X instead? Show us Mgr X and we can make a good guess. The answer is certainly going to be mixed.",
                                            "score": 0
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Legitimate-Health-29",
            "body": "What a load of shit, TB wanted to keep Poch.\n\nTypical narrative agenda reporting. Grow up.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "Headlesshorsman02",
                    "body": "So true man they need to be bashing Egbalhi and the SDs",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "imsoyluz",
            "body": "Boehly paid the price of rocking Pochettino",
            "score": 3
        },
        {
            "depth": 0,
            "author": "neverhyrok",
            "body": "I wonder who's going to replace him",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AlarmedExperience928",
                    "body": "De Zerbi just left Brighton, so it could be anybody (It's De Zerbi)",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Areawen",
                            "body": "De Zerbi will be gone even faster with his personality",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Bolmothy",
                                    "body": "but you cant forget about the important stuff like Toad Bohl wanting to buy whole Brighton (the city)",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Zestyclose-Web-8979",
                            "body": "Not according to the article or logic after the Poch firing.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Dapper_Platform_1222",
                    "body": "But it sure is fun to watch.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "lewishamilton08",
                    "body": "Kroenke’s Arsenal won’t end good either in that case then",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Proud-Cheesecake-813",
                            "body": "Based on both owners being American? Can’t think of any other similarities. Kroenke is a much better owner than Boehly.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "lewishamilton08",
                                    "body": "Arsenal have won 1 trophy in about 7 years. Chelsea have won 7 in the same period.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Proud-Cheesecake-813",
                                            "body": "You’ve won zero trophies under Boehly. You literally have no argument.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "lewishamilton08",
                                                    "body": "That’s a lie, we won the Premier League Summer Series last summer.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Proud-Cheesecake-813",
                                                            "body": "Oh wow, how could I forget that illustrious title.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "lewishamilton08",
                                                                    "body": "We’ve won it all!!! 😎",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[deleted]",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "lewishamilton08",
                                    "body": "You bottled the league again and you are in denial. You will never be champions of Europe and I know that hurts you. Know your place",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[deleted]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "lewishamilton08",
                                                    "body": "When are you winning the Champions League? Next year or never?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "[deleted]",
                                                            "body": "[deleted]",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "lewishamilton08",
                                                                    "body": "You are never winning the Champions League. Go cry about it",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "[deleted]",
                                                                            "body": "[deleted]",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "lewishamilton08",
                                                                                    "body": "Good to hear you’re fine with not winning the CL. Because you never will win it.",
                                                                                    "score": 0
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Thedudeofmanchester",
            "body": "Why did Pochettino rocked Todd's boat? Can't he buy his own? Is he stupid?",
            "score": -7,
            "replies": [
                {
                    "depth": 1,
                    "author": "zaddy2208",
                    "body": "Soccercirclejerk ain't here.",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "frohnaldo",
                            "body": "I’m so tired of this same joke structure on every soccer forum constantly. Just make it stop",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CrooksMC",
                                    "body": "Humour these days is all cut and paste and templates.",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "zaddy2208",
                                    "body": "Ain't even funny at this point. Just plain annoying",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "noxioussnake",
                                    "body": "Stop calling it soccer then.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "frohnaldo",
                                            "body": "Oh pound salt. \n\nYou call the trunk the boot which is just nonsense.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "noxioussnake",
                                                    "body": "And yanks call schools shooting ranges but here we are....",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "btmalon",
                    "body": "your tired jokes don't work here, loser",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "walketotheclif",
                            "body": "The funniest joke here is a Tottenham fan calling anyone a looser ,like man,that club is the definition of the word",
                            "score": -3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "thisiskeel",
                                    "body": "It takes one to know one. 😬",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "tyssef1",
            "body": "If Chelsea were a boat they’d be the Titanic. A shitload of money for an absolute pile of shit\n\nThe job’s a poisoned chalice and I really hope Kieran McKenna isn’t such an idiot to take it",
            "score": -3,
            "replies": [
                {
                    "depth": 1,
                    "author": "DJMOONPICKLES69",
                    "body": "Didn’t we just finish above you?",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "tyssef1",
                            "body": "You should be finishing miles above us with the money you’ve spent mate. Also you’re the second worst team to come to SJP all season after Sheff Utd",
                            "score": -2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "13blacklodgechillin",
                                    "body": "Is a Newcastle fan talking about money? That’s painfully ironic",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "tyssef1",
                                            "body": "We haven’t spent billions though. We went toe to toe with you with Dubravka in nets and Krafth partnering Schär at CB with Longstaff and miley in midfield for a big chunk of the season. And our expensive players like Bruno and Isak and Botman actually deliver. Which ones of yours do apart from Palmer and Caicedo (only towards the end of the season)?",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "13blacklodgechillin",
                                                    "body": "Aw the poor little state backed team hasn’t spent a billion yet, bummer. If we only have two people performing then that’s even more embarrassing for you guys that you finished below and injury ridden Chelsea",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "tyssef1",
                                                            "body": "You don’t know what injuries are little guy. The only first team players who haven’t had any bad injuries whatsoever this season are Bruno, Krafth and Dubravka. \n\nAlso I’ve been a Newcastle fan since before the money. I don’t care how much we spend I don’t care where we finish. I’m just saying how much more poorly this season reflects on you than us",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "13blacklodgechillin",
                                                                    "body": "No one had more injuries than Chelsea this season. So the whole you don’t know what injuries are little guy just makes you look uninformed. We finished 6th and got Europa, what did you guys get? And you’ve supported your team before the money and don’t care where you finish? Sound like  a truly great fan",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "tyssef1",
                                                                            "body": "We certainly had more injuries per capita than you. You have a massive expensive squad. The least players I can remember being missing for a game between October and April was 6 and there were times it was up to 15 or 16",
                                                                            "score": -1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "nizoubizou10",
            "body": "Poch is responsible for what happened unless he didn't clarify everything before signing the contract with Chelsea.",
            "score": -2
        },
        {
            "depth": 0,
            "author": "PunchOX",
            "body": "LoL. Boehly needs to learn a thing or two about the Premier League. Dude buys Chelsea and thinks he's Abramovich",
            "score": -4,
            "replies": [
                {
                    "depth": 1,
                    "author": "ThatFunkyOdor",
                    "body": "Its not Boehly. Its Eghbali",
                    "score": 17
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": -7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Headlesshorsman02",
                    "body": "It was Egbalhi that got rid of him not Bohley, he is just the fall guy for the true numb sculls",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "HipGuide2",
            "body": "Poch was by all accounts tactically lost (why they only started to play well in March) and threw a fit when the Gallagher stuff started.",
            "score": -5,
            "replies": [
                {
                    "depth": 1,
                    "author": "hipcheck23",
                    "body": "> threw a fit when the Gallagher stuff started\n\nI don't know about that. It sounds like he expected to be part of the summer window and he was locked out, and then was disappointed with the haul. He didn't like their plans with Maatsen, he didn't like having a short squad. And then after the Wolves match, the board let him know they weren't happy with things, and from that point on, it was the board demanding/asking/suggesting that he do X or Y and him refusing. Clearly he didn't want to lose his prototypical player, but it sounds like that was only one issue of many.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "lewishamilton08",
            "body": "De Zerbi is a massive upgrade on Poch, so no need to panic.",
            "score": -22,
            "replies": [
                {
                    "depth": 1,
                    "author": "Existing_Dig_8587",
                    "body": "Is he ? Seems like a disaster waiting to happen",
                    "score": 11
                },
                {
                    "depth": 1,
                    "author": "TRGuy335",
                    "body": "I’m not so sure, massively stubborn tactically, Brighton got found out midway through the season, refused how they played and ended up with 16 points from their last 19 games (relegation form, essentially).  I know injuries played a part, but I think a huge element was just never changing our setup.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lewishamilton08",
                            "body": "Stubborn tactically but right. Positional play principles and possession based progressive football. Much better players and way bigger budget at his disposal. De Zerbi would be perfect for us. Poch tactically played against our players strengths when we were primed for JdP football.",
                            "score": -2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "porky8686",
                    "body": "Based on what?",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lewishamilton08",
                            "body": "Style of football.",
                            "score": -2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "porky8686",
                                    "body": "That’s weak… Spurs played good football at a higher standard than Brighton or Udinese ever did.. should have given him another year.",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "TakeItEasy-ButTakeIt",
                                    "body": "That worked out for Leeds with Bielsa, right? Lol",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "lewishamilton08",
                                            "body": "It worked out for Pep, Alonso, Tuchel, etc etc. Possession based progressive football has more wins than losses.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "TakeItEasy-ButTakeIt",
                                                    "body": "True. However, managers like Pep and Arteta have been able to sculpt the squad they want. Chelsea have tended to throw money at their problems recently without specific direction of the man in charge of the tactics. If they get that right, then they will be a dangerous club again.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "shpatibot",
                    "body": "Chelsea fans don’t want De Zerbi because we poached a lot of Brighton to begin.. I personally rate De Zerbi and think he could be a quality manager with backing",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lewishamilton08",
                            "body": "He will be brilliant at Chelsea because we have the players and the style of football suits the players we have also. He is also stubborn on that style so won’t be a coward like Poch was (Poch had us playing amazing in pre season and tactically, but then reverted to type for most of the season)",
                            "score": 0
                        }
                    ]
                }
            ]
        }
    ]
}