{
    "title": "Benjamin Sesko update",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Fellow fans, this is a friendly reminder to please follow the [Rules](https://www.reddit.com/r/premierleague/about/rules) and [Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette). \n\nPlease also make sure to [Join us on Discord](https://discord.gg/football)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PremierLeague) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ItsTom___",
            "body": "'Both Chelsea and Arsenal\"\n\nRegular occurrence at this point",
            "score": 17,
            "replies": [
                {
                    "depth": 1,
                    "author": "Headlesshorsman02",
                    "body": "Lmao we have been linked with him before you guys at this point though at least this time",
                    "score": -2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Franchise1109",
                            "body": "We were linked back last summer and in Jan",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Headlesshorsman02",
                                    "body": "We had been linked with him when he was at Salzburg when the owners first came in. He has been on our list of players for almost 2 years I think",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "AlonFenn",
                                            "body": "Well we were linked with him when he was in the womb! Beat that",
                                            "score": 21
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Franchise1109",
                                            "body": "lol sounds good. Yet you chose Nico Jackson in that time \n\nHe was rumored for more than Chelsea too",
                                            "score": 6
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "batch1972",
            "body": "I thought he was going to captain DS9",
            "score": 9
        },
        {
            "depth": 0,
            "author": "LuckyNumber003",
            "body": "Saw him linked with Utd too, agent clearly doing the rounds to drive the price up",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "Dizzy-Locksmith9700",
                    "body": "He’s got a release clause",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "The_All_Seeing_Pi",
            "body": "He was good in deep space nine.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Immediate_Wolf3802",
            "body": "He's grown on me at Leipzig after being unimpressed at Salzburg for a 6'5 it's rare anyone's that good as he is with his feet as he has good balling skills aswell as obvious aerial ability ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Pendulum122",
            "body": "Last sentence is gold",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MichaelFishbender",
            "body": "Do Chelsea really need another attacking player? Between Palmer, Mudryk, Jackson, Madueke they werent having that much trouble scoring, esp not by the end of last season. It feels like Chelsea just throw money at everyone. ",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "SureLookThisIsIt",
                    "body": "Tbf only 1 of the players you mentioned is a striker.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MichaelFishbender",
                            "body": "Yea fair point.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "milkonyourmustache",
            "body": "€64m release clause, just 20, very high upside potential, is already one of the best finishers in the world, and Arsenal need a clinical goal scorer.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "Mba1956",
                    "body": "If he was one of the best finishers in the world his stats would be higher. He has potential to improve as he ages and gets stronger.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "milkonyourmustache",
                            "body": "Being a good finisher isn't about volume, it's about shot accuracy and conversion rate, of which he ranks in the 95th percentile.\n\nSesko doesn't take a ton of shots, Openda takes the majority of Leipzig's shots, and scores the most goals as a result, but has a much worse conversion rate. Would you argue Openda is the better finisher because he scores more goals and therefore has higher stats?",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "kolasinats",
                                    "body": "How come Openda is their main goal scorer? Is Sesko more of a second striker/false 9?\n\nDoes Arsenal need that or a typical striker like Isak for example?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "milkonyourmustache",
                                            "body": "It's the way Leipzig play, Sesko holds the ball up and brings others into play, opening up space for Openda who also takes their pens.\n\nWe definitely would be better with someone like Isak, but Isak is not available, like at all, and the striker market is pretty dead in general.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Any_Witness_1000",
                                                    "body": "the description you used to me seems like a bit worse G. Jesus? Isnt G. Jesus the reason we need a proper striker? Why bring in someone like him?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "milkonyourmustache",
                                                            "body": "He's nothing like Jesus, the two couldn't be more opposite in profile. Jesus has 2 big problems - Injury record, and not being clinical. Sesko has a great injury record and *is* clinical. Jesus is 5'9 and relies on his agility, speed, unpredictability, and quick feet. Sesko is 6'4 target man.",
                                                            "score": 3
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "imsoyluz",
            "body": "Should sign with Liverpool",
            "score": 0
        },
        {
            "depth": 0,
            "author": "lewishamilton08",
            "body": "Minor if we have to go head to head with Arsenal for him. We all know how that ends, he’s Chels",
            "score": 0
        },
        {
            "depth": 0,
            "author": "FlukyS",
            "body": "Newcastle are sniffing around as well since before he went to RB Leipzig, the consensus is that if Wilson goes we could go after Sesko as the replacement and have him rotating with Isak sometimes on LW and Gordon RW like we tried with Wilson when he was fit. I could see him in the PL given the type of player he is, it suits bigger strikers who are comfortable with tight marking.",
            "score": -2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Gligadi",
                    "body": "Doesn't Newcastle have to sell before buying anyone? Šeško isn't cheap either.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FlukyS",
                            "body": "PSR is rolling accounting periods of 4 years. Every summer is a new window. The expectation is we have at least 150m in allowable spending without selling anyone. Yes we were right on PSR last year after signing Gordon, Barnes, Minteh and Tonali but we also had CL money to spend. If we retain both Isak and Bruno G that maybe takes a bit of that headroom away with wages but we have enough to get in a few and we definitely will be selling multiple players like Almiron, Dubravka and releasing others like Karius.",
                            "score": -1
                        }
                    ]
                }
            ]
        }
    ]
}