{
    "title": "Which club side is bigger everton and blackburn rovers or aston villa and wolves? ",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Fellow fans, this is a friendly reminder to please follow the [Rules](https://www.reddit.com/r/premierleague/about/rules) and [Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette). \n\nPlease also make sure to [Join us on Discord](https://discord.gg/football)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PremierLeague) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "EwokSuperPig___",
            "body": "Everton is the biggest here then probably Villa, Blackburn and wolves. That’s just the initial thought and I’m not expert on all their history",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "YoungThriftShop",
                    "body": "Everton is the most storied club in English Football",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "EwokSuperPig___",
                            "body": "You think villa are bigger?",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Agreeable-World-9572",
            "body": "Eveton and blackburn rovers if we have to pick one side since historically everton are bigger than aston villa having scored more goals and more in top flight football while same for blackburn rovers compared to wolves as well winning the premier league",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DEGRAYER",
            "body": "Villa for me. European cup.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Agreeable-World-9572",
                    "body": "\nYet beating medicore teams throughout the competition and only decent team was bayern munich they beat.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "External-Piccolo-626",
                            "body": "The hard part was winning the league the previous season.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Poop_Scissors",
                                    "body": "That's the only league they've won since before the first world war though. Everton are a far bigger side.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "kiwisrkool",
                                            "body": "Yeah, but you've got Dyche, we've got Emery! 😝",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "William_Taylor-Jade",
                                            "body": "Villa literally invented the football league. It was William McGregor and Aston Villa who brought the original founding members together with the proposal.\n\nSo you are arguing over when league titles were won in a league system out initially in place by Villa 🤷🏻",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "graveyeverton93",
            "body": "For people saying Villa because of the European Cup, keep in mind that our Title winning teams of that era unfortunately could not compete for it because of the ban! And we did also win the European Cup Winners Cup in 85! Villa are like our Brother Club to me! Very similar histories and both have an amazing fan following at home and away, I mean Everton Aston Villa is literally the most played fixture in the English Top Flight.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Golden-Event-Horizon",
            "body": "1. Villa\n2. Everton\n3. Wolves\n4. Blackburn Rovers",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BlueMoonCityzen",
            "body": "Villa or Everton are quite significantly bigger than the other two\n\nEverton held up by longevity in top divisions and Villa by success out of England",
            "score": 1
        }
    ]
}