{
    "title": "[OFFICIAL] Julen Lopetegui appointed West Ham United Head Coach",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Fellow fans, this is a friendly reminder to please follow the [Rules](https://www.reddit.com/r/premierleague/about/rules) and [Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette). \n\nPlease also make sure to [Join us on Discord](https://discord.gg/football)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PremierLeague) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Kezmangotagoal",
            "body": "I’d be amazed if he he’s still their coach next season.\n\nI’ve never understood how he keeps landing these kinds of jobs.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "graveyeverton93",
            "body": "Great Manager! The only thing is, that they got rid of Moyes because his style of play isn't the best to watch, but neither is Lopetegui's!",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bulbamew",
                    "body": "I don’t think that’s why they got rid of Moyes. It was a key reason why fans turned on him though",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "graveyeverton93",
                            "body": "Fan pressure goes a long way to getting rid of a manger mate, it's only a matter of time when the match going fans turn.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Bulbamew",
                                    "body": "The style of play specifically isn’t why they got rid though. If it was, and they only made these managerial decisions based on what the fans want, they wouldn’t have hired Lopetegui. \n\nThe fans will turn on this guy within months if results are bad, but that doesn’t mean they’ll sack him straight away",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Substantial-Land-867",
            "body": "He won’t last a season, he’ll walk before Easter. He always walks, hugely unreliable",
            "score": 3
        },
        {
            "depth": 0,
            "author": "EwokSuperPig___",
            "body": "I think Moyes couldn’t have taken the club any further but the appointment seems naive. Feels like they looked where he had managed before rather than how it went down. Could be one of the earliest sacking of the season",
            "score": 1
        },
        {
            "depth": 0,
            "author": "uncle_monty",
            "body": "That makes 4 Basque managers in the Premier League. Somebody needs to hire Deschamps after the Euro's to give us 25% Basques.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "WyboSF",
                    "body": "I’m honestly surprised he’s never managed us",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Immediate_Wolf3802",
            "body": "He has unfinished business in the Premiership...good contacts to La Liga talent ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ShmoopToThrill89",
            "body": "Surely he had to have known about Paqueta situation but if not, welcome to the west ham way.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LMinggg",
            "body": "#NOPETEGUI",
            "score": 1
        },
        {
            "depth": 0,
            "author": "GMD3S1GNS",
            "body": "Old news, pretty much confirmed like a month ago",
            "score": 1
        }
    ]
}